package java.kadai.se.cat02.sec02_modeling.no005;


public class Bird {

	/** 名前
	 *  ※変数には、役割を反映させた名前をつけましょう！
	 */


	/** 年齢
	 *  ※変数には、役割を反映させた名前をつけましょう！
	 */


	/**
	 * 鳥を作るときに必要な情報を入れるためのコンストラクタ
	 * 鳥の名前と鳥の年齢を引数で渡し、フィールド変数へセットするようにしましょう。
	 */


	/**
	 * フィールド変数を使用し、
	 *「(鳥の名前)がピッピーと鳴いた」という文字列を返して(return)ください。
	 */
	public String sing() {

	}

	/**
	 * 鳥の年齢を1つ増やします。
	 * growメソッドが呼び出されるたびに鳥が1歳年をとります。
	 */
	public void grow() {

	}

	/**
	 * フィールド変数を使用し、
	 * 「(鳥の名前)が飛んだ」という文字列を返して(return)ください。
	 */
	public String fly() {

	}

	// 以下フィールド変数のgetterを実装しましょう

}
