package java.kadai.se.cat02.sec02_modeling.no005;


public class Cat {

	/** 名前
	 *  ※変数には、役割を反映させた名前をつけましょう！
	 */


	/** 年齢
	 *  ※変数には、役割を反映させた名前をつけましょう！
	 */


	/**
	 * 猫を作るときに必要な情報を入れるためのコンストラクタ
	 * 猫の名前と猫の年齢を引数で渡し、フィールド変数へセットするようにしましょう。
	 */


	/**
	 * フィールド変数を使用し、
	 *「(猫の名前)がニャーと鳴いた」という文字列を返して(return)ください。
	 */
	public String mew() {

	}

	/**
	 * 猫の年齢を1つ増やします。
	 * growメソッドが呼び出されるたびに猫が1歳年をとります。
	 */
	public void grow() {

	}

	/**
	 * フィールド変数を使用し、
	 * 「(猫の名前)が歩いた」という文字列を返して(return)ください。
	 */
	public String walk() {

	}

	// 以下フィールド変数のgetterを実装しましょう

}
