package java.kadai.se.cat02.sec01_algorithm.no007;

/**
 * Javaアルゴリズム問題7
 */
public class Algorithm07 {

	public static void main(String[] args) {

		// ■ ①の要求をみたすプログラムを作成しましょう。

		// ① 変数x,y,z3つの内最大値を求めるプログラムを作成しましょう。
		//    xに「83」、yに「45」、zに「62」を代入し挙動を確認しましょう。
		//    ⇒【実行結果】最大値は83です

		// ---------- ①解答 start ----------



		// ---------- ①解答 end ----------

		System.out.println();
		System.out.println("===================================");

		// ② ①で作成したプログラムの変数値を「x=12」「y=34」「z=47」に変更した場合、
		//    以下実行結果通りに表示されるか確認しましょう。
		//    ⇒【実行結果】最大値は47です

		// ---------- ②解答 start ----------



		// ---------- ②解答 end ----------

	}

}
